#+TITLE: stuff that surprises me. don't know if bug or something else.

* leiningen project with =ring= dev-dependency                      :clojure:

  [2012-03-20 Tue]

#+begin_src sh
lein version
#+end_src

#+results:
: Leiningen 1.7.0 on Java 1.6.0_26 Java HotSpot(TM) 64-Bit Server VM


#+begin_src sh :eval never
lein new hoge
cd hoge
vi project.clj
#+end_src

  
